reference/openfoam/incompressible_channel/system/probes.cfg
type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

fields (U p);

// Probe points at structured-cell centers along a vertical line:
//   x = 0.4875 (i = 19 for Nx=40, dx=0.025)
//   y = dy/2 .. H - dy/2 with Ny=20, dy=0.01
probeLocations
(
    (0.4875 0.005 0)
    (0.4875 0.015 0)
    (0.4875 0.025 0)
    (0.4875 0.035 0)
    (0.4875 0.045 0)
    (0.4875 0.055 0)
    (0.4875 0.065 0)
    (0.4875 0.075 0)
    (0.4875 0.085 0)
    (0.4875 0.095 0)
    (0.4875 0.105 0)
    (0.4875 0.115 0)
    (0.4875 0.125 0)
    (0.4875 0.135 0)
    (0.4875 0.145 0)
    (0.4875 0.155 0)
    (0.4875 0.165 0)
    (0.4875 0.175 0)
    (0.4875 0.185 0)
    (0.4875 0.195 0)
);

